OpenFOAM-13/tutorials/multiRegion/film/cylinder/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication -s fluid blockMesh -region fluid

runApplication decomposePar -region fluid -noFields

runParallel extrudeToRegionMesh -region fluid

runApplication -s fields decomposePar -fields -copyZero

runParallel foamMultiRun

runApplication reconstructPar -allRegions

printf "\n%s\n" "Creating files for paraview post-processing"
paraFoam -touchAll
echo

#------------------------------------------------------------------------------
